/*
全排列数的生成
【问题描述】输入整数N( 1 <= N <= 10 )，生成从1~N所有整数的全排列。
【输入形式】输入整数N。
【输出形式】输出有N!行，每行都是从1~N所有整数的一个全排列，各整数之间以空格分隔。各行上的全排列不重复。输出各行遵循“小数优先”原则, 在各全排列中，较小的数尽量靠前输出。如果将每行上的输出看成一个数字，则所有输出构成升序数列。具体格式见输出样例。
【样例输入1】1
【样例输出1】1
【样例说明1】输入整数N=1，其全排列只有一种。
【样例输入2】3 
【样例输出2】
1 2 3
1 3 2
2 1 3
2 3 1
3 1 2
3 2 1
【样例说明2】输入整数N=3，要求整数1、2、3的所有全排列, 共有N!=6行。且先输出1开头的所有排列数，再输出2开头的所有排列数，最后输出3开头的所有排列数。在以1开头的所有全排列中同样遵循此原则。
【样例输入3】10
【样例输出3】
1 2 3 4 5 6 7 8 9 10
1 2 3 4 5 6 7 8 10 9
1 2 3 4 5 6 7 9 8 10
1 2 3 4 5 6 7 9 10 8
1 2 3 4 5 6 7 10 8 9
1 2 3 4 5 6 7 10 9 8
1 2 3 4 5 6 8 7 9 10
1 2 3 4 5 6 8 7 10 9
1 2 3 4 5 6 8 9 7 10
1 2 3 4 5 6 8 9 10 7
……………………
【样例说明3】输入整数N=10，要求整数1、2、3、……、10的所有全排列。上例显示了输出的前10行。
【运行时限】要求每次运行时间限制在20秒之内。超出该时间则认为程序错误。提示：当N增大时，运行时间将急剧增加。在编程时要注意尽量优化算法，提高运行效率。
【评分标准】该题要求输出若干行整数。
*/

#include <stdio.h>

int chess[21][21];

int test(int i, int j)
{
    if(chess[i][j] != 0 &&
       chess[i][j] == chess[i][j + 1] && 
       chess[i][j] == chess[i][j + 2] &&
       chess[i][j] == chess[i][j + 3])
    {
        if(chess[i][j-1] == 0 || chess[i][j + 4] == 0)
        {
            printf("%d:%d,%d", chess[i][j], i, j);
            return 1;
        }
    }
    else if(chess[i][j] != 0 &&
            chess[i][j] == chess[i + 1][j] && 
            chess[i][j] == chess[i + 2][j] &&
            chess[i][j] == chess[i + 3][j])
    {
        if(chess[i - 1][j] == 0 || chess[i + 4][j] == 0)
        {
            printf("%d:%d,%d", chess[i][j], i, j);
            return 1;
        }
    }
    else if(chess[i][j] != 0 &&
            chess[i][j] == chess[i + 1][j + 1] && 
            chess[i][j] == chess[i + 2][j + 2] &&
            chess[i][j] == chess[i + 3][j + 3])
    {
        if(chess[i - 1][j - 1] == 0 || chess[i + 4][j + 4] == 0)
        {
            printf("%d:%d,%d\n", chess[i][j], i, j);
            return 1;
        }
    }
    return 0;
}

int main()
{
    for(int i = 0; i < 21; i++)
    {
        chess[i][0] = chess[i][20] = chess[0][i] = chess[20][i] = 3;
    }

    for(int i = 1; i <= 19; i++)
    for(int j = 1; j <= 19; j++)
    scanf("%d", &chess[i][j]);

    for(int i = 1; i <= 16; i++)
    for(int j = 1; j <= 16; j++)
    if(test(i, j)) return 0;

    printf("No\n");
    return 0;
}